CSI API ETABS v1
cPointObj.GetSelected Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSelected(
	string Name,
	ref bool Selected
)
Function GetSelected (
	Name As String,
	ByRef Selected As Boolean
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim Selected As Boolean
Dim returnValue As Integer
returnValue = instance.GetSelected(Name,
	Selected)
int GetSelected(
	String^ Name,
	bool% Selected
)
abstract GetSelected :
        Name : string *
        Selected : bool byref -> int
Parameters
Name
Type: System.String
Selected
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cPointObj Interface
ETABSv1 Namespace